app/controllers/chamados_controller.rb

  def index
    define_layout
      if (params[:search].nil? || params[:search].empty?)
        @chamados_totais = Chamado.all
        @chamados = Chamado.nao_encerrado
        @chamados_aberto = Chamado.aberto
        @chamados_encerrado = Chamado.encerrado
        @chamados_terceiros = Chamado.terceiro
        @chamados_motoristas = Chamado.motorista
        @chamados_compras = Chamado.compras
        @chamados_atendimento = Chamado.atendimento
        @chamados_externo = Chamado.externo
        $var = 0
      else
        @chamados = Chamado.find(:all, :joins => :unidade, :conditions => ["unidades.nome like ?", "%" + params[:search].to_s + "%"], :order => 'situacao_chamado_id,nome DESC')
---
SELECT * FROM `chamados` WHERE (situacao_chamado_id != 12) ORDER BY situacao_chamado_id,data_sol DESC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 16)

  def load_tipos
    @tipos = TiposProblema.find(:all)
---
SELECT * FROM `tipos_problemas` WHERE (`tipos_problemas`.`id` = 9)

  def load_situacaos
    @situacaos = SituacaoChamado.find(:all)
---
SELECT * FROM `situacao_chamados` WHERE (`situacao_chamados`.`id` = 1)

  def load_estagiarios
    @estagiarios = Estagiario.find(:all, :order => 'nome ASC',:conditions => ['desligado=?',0])
---
SELECT * FROM `estagiarios` WHERE (desligado=0 and unidade_id=53 and id<>2 and id<>47) ORDER BY nome ASC