app/controllers/estatisticas_controller.rb

SELECT * FROM `mmanutencaos` WHERE (situacao_manutencao_id <> 2 OR situacao_manutencao_id <> 9)
SELECT * FROM `tipos_manutencaos` WHERE (`tipos_manutencaos`.`id` = 23)
SELECT `mmanutencaos`.* FROM `mmanutencaos` INNER JOIN mmanutencaos_tipos_manutencaos ON mmanutencaos.id = mmanutencaos_tipos_manutencaos.mmanutencao_id WHERE ( (mmanutencaos.situacao_manutencao_id <> 2 AND mmanutencaos.situacao_manutencao_id <> 9) AND mmanutencaos_tipos_manutencaos.tipos_manutencao_id = 23)
---
   def por_servico
    $menu=1
    session[:input] = params[:contact][:grafico_id]
         vencerrado= (Mmanutencao.encerrado_servico(session[:input])).length
         vaberto = (Mmanutencao.aberto_servico(session[:input])).length
         vtotal= Mmanutencao.geral.length
        quant_unidade = Unidade.all(:conditions =>['desativada = 0']).count


        valvenaria = Mmanutencao.find(:all, :joins => 'INNER JOIN mmanutencaos_tipos_manutencaos ON mmanutencaos.id = mmanutencaos_tipos_manutencaos.mmanutencao_id',  :conditions =>["mmanutencaos_tipos_manutencaos.tipos_manutencao_id= 1 ", session[:input] ]).size

SELECT * FROM `unidades` WHERE (desativada = 0)
---
  def load_unidades
       @unidades = Unidade.find(:all, :order => 'nome ASC')