app/controllers/mmanutencaos_controller.rb

def consulta_abertos_unidade
     if params[:type_of].to_i == 1   #serviço
         session[:impressao_abertos]=1
        session[:type_of] = 1
        session[:tipo]=  params[:manutencao][:tipo]
        session[:servico]=  TiposManutencao.find_by_id(session[:tipo]).servico
---
SELECT * FROM `tipos_manutencaos` WHERE (`tipos_manutencaos`.`id` = '1') LIMIT 1