app/controllers/mmanutencaos_controller.rb

SELECT * FROM `unidades` WHERE (id=52)
---
def consultas_encerrados
     if current_user.has_role?('admin') or current_user.has_role?('admin_manutencao')or current_user.has_role?('SEDUC')
      @unidades_manutencao =  Unidade.find(:all, :order => 'nome ASC')

SELECT * FROM `chefias` WHERE (`chefias`.`id` = 6)
SELECT * FROM `situacao_manutencaos` WHERE (`situacao_manutencaos`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
                  session[:type_of] = 3
                        if current_user.has_role?('admin') or current_user.has_role?('admin_manutencao') or current_user.has_role?('terceiro')or current_user.has_role?('oficios')or current_user.has_role?('estagiario SEDUC') or current_user.has_role?('SEDUC')
                            #@mmanutencaos = Mmanutencao.find_by_sql("SELECT uni.nome as nome, mma.id, mma.unidade_id, mma.situacao_manutencao_id, mma.funcionario_id, mma.ffuncionario, mma.chefia_id, mma.user_id, mma.descricao, mma.data_sol, mma.data_ate, mma.data_enc, mma.forma, mma.solicitante, mma.procedimentos, mma.executado, mma.justificativa, mma.obs  FROM mmanutencaos mma INNER JOIN "+session[:base]+".unidades uni ON uni.id = mma.unidade_id WHERE situacao_manutencao_id = 2")
                            @mmanutencaos = Mmanutencao.find(:all, :select =>'(unidades.nome) AS nome, mmanutencaos.id, mmanutencaos.unidade_id,  mmanutencaos.situacao_manutencao_id, mmanutencaos.funcionario_id, mmanutencaos.ffuncionario, mmanutencaos.chefia_id, mmanutencaos.user_id, mmanutencaos.descricao, mmanutencaos.data_sol, mmanutencaos.data_ate, mmanutencaos.data_enc, mmanutencaos.forma, mmanutencaos.solicitante, mmanutencaos.procedimentos, mmanutencaos.executado, mmanutencaos.justificativa, mmanutencaos.obs',:joins=> 'INNER JOIN '+session[:base]+'.unidades ON unidades.id = mmanutencaos.unidade_id', :conditions => ["mmanutencaos.descricao like ?", "%" + params[:palavra].to_s + "%"],:order => 'mmanutencaos.data_sol DESC' )

SELECT * FROM `situacao_manutencaos` WHERE (id <> 2) ORDER BY situacao
SELECT * FROM `unidades` WHERE (id=52)
---
def consultas_abertos
     @situacao_manutencao =  SituacaoManutencao.find(:all, :conditions =>  ["id <> 2"], :order => 'situacao')

     if current_user.has_role?('admin') or current_user.has_role?('admin_manutencao')or current_user.has_role?('SEDUC')
      @unidades_manutencao =  Unidade.find(:all, :order => 'nome ASC')

SELECT * FROM `tipos_manutencaos` WHERE (id ='1')
---
 def relatorios_manutencaos
   session[:dataI]=params[:manutecao][:dataI][6,4]+'-'+params[:manutecao][:dataI][3,2]+'-'+params[:manutecao][:dataI][0,2]
   session[:dataF]=params[:manutecao][:dataF][6,4]+'-'+params[:manutecao][:dataF][3,2]+'-'+params[:manutecao][:dataF][0,2]
   session[:dataI2]=params[:manutecao][:dataI][0,2]+'/'+ params[:manutecao][:dataI][3,2]+'/'+params[:manutecao][:dataI][6,4]
   session[:dataF2]=params[:manutecao][:dataF][0,2]+'/'+ params[:manutecao][:dataF][3,2]+'/'+params[:manutecao][:dataF][6,4]

   w=session[:manutencaotipos_manutencao_id]=params[:manutencao][:tipos_manutencao_id]
     if !session[:manutencaotipos_manutencao_id].empty?
         @servico= TiposManutencao.find(:all, :conditions=> ['id =?',  params[:manutencao][:tipos_manutencao_id]] )

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)
---
  def show
    @mmanutencao = Mmanutencao.find(params[:id])

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)
UPDATE `mmanutencaos` SET `chefia_id` = 6, `updated_at` = '2021-09-10 11:49:08', `obs` = '', `situacao_manutencao_id` = 5, `procedimentos` = 'teste' WHERE `id` = 11275
---
  def update
    @mmanutencao = Mmanutencao.find(params[:id])
   respond_to do |format|
      if @mmanutencao.update_attributes(params[:mmanutencao])

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11287)
---
  def despacho
    @mmanutencao = Mmanutencao.find(params[:id])

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)
---
 def terceirizada
    @mmanutencao = Mmanutencao.find(params[:id])

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11287)
---
 def ordemservico
    @mmanutencao = Mmanutencao.find(params[:id])

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11288)
---
 def impressao_manutencao
   @mmanutencao = Mmanutencao.find(params[:id])

SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11287)
---
 def imp_manutencao
    @mmanutencao= Mmanutencao.find(session[:idmanutencao])

SELECT * FROM `unidades` WHERE (id=52)
---
 def busca_protocolo
$ok=1
    if (params[:search].present?)
      if current_user.has_role?('admin') or current_user.has_role?('admin_manutencao')
        @mmanutencao = Mmanutencao.find(:all, :conditions => ["id = ?",  params[:search]])
        $ok=0
     else
        if current_user.has_role?('diretor_unidade')
           @mmanutencao = Mmanutencao.find(:all, :conditions => ["id = ? and unidade_id=?",  params[:search], current_user.unidade_id])