app/controllers/passwords_controller.rb

  def tela_email_devolucao
   @mmanutencao = Mmanutencao.find(session[:id_manutencao])
---
SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)

  def tela_email_devolucao_compra
   @mmanutencao = Mmanutencao.find(session[:id_manutencao])
---
SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)

   def email_devolucao
t=0
  #   participante = Participante.find_by_matricula(params[:matricula])
       wwa=email=session[:email]
t=0
      if !session[:id_manutencao].nil?
       @mmanutencao= Mmanutencao.find(session[:id_manutencao])
       @mmanutencao.data3= Time.now
       @mmanutencao.save
---
SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)
UPDATE `mmanutencaos` SET `data3` = '2021-09-10 07:59:25', `updated_at` = '2021-09-10 10:59:25' WHERE `id` = 11276

   def email_devolucao_compra
t=0
  #   participante = Participante.find_by_matricula(params[:matricula])
       wwa=email=session[:email]
t=0
      if !session[:id_manutencao].nil?
       @mmanutencao= Mmanutencao.find(session[:id_manutencao])
       @mmanutencao.data3= Time.now
       @mmanutencao.save
---
SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11276)
UPDATE `mmanutencaos` SET `data3` = '2021-09-10 08:40:57', `updated_at` = '2021-09-10 11:40:57' WHERE `id` = 11276

   def imp_manutencao
    @mmanutencao= Mmanutencao.find(session[:idmanutencao])
---
SELECT * FROM `mmanutencaos` WHERE (`mmanutencaos`.`id` = 11288)