app/controllers/reservar_salas_controller.rb

SELECT * FROM `salas` WHERE (status = 1) ORDER BY sala ASC
SELECT * FROM `servicos_salas` WHERE (status = 1)
---
 def load_servicos_salas
  @servicos_salas = ServicosSala.find(:all, :conditions=>['status = 1'] )