app/controllers/sessions_controller.rb

SELECT * FROM `cursos` WHERE (status = 0)
---
  def load_cursos
    @cursos = Curso.find(:all, :conditions => ['status = 0'])